

// Панель Свойств: чек - бокс (Флаг) Клиент (управляемое приложение)
Процедура ПересчетСтроки(СтрокаТЧ, ПересчитатьСумму, Форма =  Неопределено)  Экспорт 
	
	Если ПересчитатьСумму Тогда 
		
		СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;    
		
	Иначе  
		Если СтрокаТЧ.Количество <> 0 Тогда  	
			СтрокаТЧ.Цена = СтрокаТЧ.Сумма / СтрокаТЧ.Количество; 	
		Иначе   
			
			СтрокаТЧ.Цена = СтрокаТЧ.Сумма;
			СтрокаТЧ.Количество = 1; 
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Если Форма <> Неопределено Тогда 
		Форма.ОбновитьИтоги();
	КонецЕсли;
	
	
КонецПроцедуры