
&НаКлиенте
Процедура ПересчетСтроки(СтрокаТЧ)
	
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
	
КонецПроцедуры


&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрокаТЧ = Элементы.СписокНоменклатуры.ТекущиеДанные; 
	
	ПересчетСтроки(ТекущаяСтрокаТЧ);
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)   
	
	ТекущаяСтрокаТЧ = Элементы.СписокНоменклатуры.ТекущиеДанные; 
	
	ПересчетСтроки(ТекущаяСтрокаТЧ); 
	
КонецПроцедуры


