
&НаКлиенте
Процедура ОбновитьИтоги() Экспорт 
	
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");
	
КонецПроцедуры


&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрокаТЧ = Элементы.СписокНоменклатуры.ТекущиеДанные; 
	
	ОбщегоНазначения.ПересчетСтроки(ТекущаяСтрокаТЧ, Истина, ЭтотОбъект);
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)   
	
	ТекущаяСтрокаТЧ = Элементы.СписокНоменклатуры.ТекущиеДанные; 
	
	ОбщегоНазначения.ПересчетСтроки(ТекущаяСтрокаТЧ, Истина, ЭтотОбъект); 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСуммаПриИзменении(Элемент)    
	
	ТекущаяСтрокаТЧ = Элементы.СписокНоменклатуры.ТекущиеДанные;  
	
	ОбщегоНазначения.ПересчетСтроки(ТекущаяСтрокаТЧ, Ложь, ЭтотОбъект);
	
КонецПроцедуры


