
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОсновныеНачисления.Записывать = Истина;
	Движения.ДополнительныеНачисления.Записывать = Истина;
	
	
	Для Каждого ТекСтрокаСписок Из Список Цикл 
		Если ТипЗнч(ТекСтрокаСписок.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисления") Тогда		
			
			// регистр ОсновныеНачисления
			
			Движение = Движения.ОсновныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = ТекСтрокаСписок.ВидРасчета;
			
			//  Период Действия
			Движение.ПериодДействияНачало = ТекСтрокаСписок.ДатаНачала;
			Движение.ПериодДействияКонец = КонецДня(ТекСтрокаСписок.ДатаОкончания);
			Движение.ПериодРегистрации = ПериодРегистрации;
			
			// Если  КМД - 2 Месяца
			Если Движение.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Командировка Тогда      
				
				Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Движение.ПериодДействияНачало,-2)); 			
				Движение.БазовыйПериодКонец =  КонецМесяца(ДобавитьМесяц(Движение.ПериодДействияНачало,-1));  
				
			КонецЕсли;	
			
			Движение.Подразделение = ТекСтрокаСписок.Подразделение;
			Движение.Сотрудник = ТекСтрокаСписок.Сотрудник;
			Движение.Результат = ТекСтрокаСписок.Размер;
			Движение.График = ТекСтрокаСписок.График;
			Движение.Размер = ТекСтрокаСписок.Размер;  
			
		ИначеЕсли ТипЗнч(ТекСтрокаСписок.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ДополнительныеНачисления") Тогда
			
			
			// регистр ДополнительныеНачисления
			Движение = Движения.ДополнительныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = ТекСтрокаСписок.ВидРасчета;
			
			Движение.ПериодРегистрации = ПериодРегистрации;
			
			// ЕСли ПРЕМИЯ Базовый Период  Месяц		
			Если Движение.ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисления.Премия Тогда      
				
				Движение.БазовыйПериодНачало = НачалоМесяца(ПериодРегистрации); 			
				Движение.БазовыйПериодКонец =  КонецМесяца(ПериодРегистрации);  
				
			КонецЕсли;
			
			Движение.Подразделение = ТекСтрокаСписок.Подразделение;
			Движение.Сотрудник = ТекСтрокаСписок.Сотрудник;
			Движение.Результат = ТекСтрокаСписок.Размер;
			Движение.Размер = ТекСтрокаСписок.Размер;
			
		КонецЕсли;		
	КонецЦикла;       
	
	ТаблицаДополнений = Движения.ОсновныеНачисления.ПолучитьДополнение();
	
	Для каждого СтрокаТаблицы  Из ТаблицаДополнений Цикл
		
		// регистр ОсновныеНачисления
		Движение = Движения.ОсновныеНачисления.Добавить();
		Движение.Сторно = Истина;
		Движение.ВидРасчета = СтрокаТаблицы.ВидРасчета;
		Движение.ПериодДействияНачало = СтрокаТаблицы.ПериодДействияНачалоСторно;
		Движение.ПериодДействияКонец = КонецДня(СтрокаТаблицы.ПериодДействияКонецСторно);
		Движение.ПериодРегистрации = СтрокаТаблицы.ПериодРегистрацииСторно;  
		
		Движение.Подразделение = СтрокаТаблицы.Подразделение;
		Движение.Сотрудник = СтрокаТаблицы.Сотрудник;
		Движение.График = ТекСтрокаСписок.График;
		Движение.Размер = -СтрокаТаблицы.Размер
		
	КонецЦикла;
	
	Движения.Записать();
	
	
КонецПроцедуры
