

Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	// регистр ОсновныеНачисления
	Движения.ОсновныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаСписок Из Список Цикл
		Движение = Движения.ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаСписок.ВидРасчета;
		Движение.ПериодДействияНачало = ПериодРегистрации;
		Движение.ПериодДействияКонец = ПериодРегистрации;
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.БазовыйПериодНачало = ПериодРегистрации;
		Движение.БазовыйПериодКонец = ПериодРегистрации;
		Движение.Подразделение = ТекСтрокаСписок.Подразделение;
		Движение.Сотрудник = ТекСтрокаСписок.Сотрудник;
		Движение.Результат = ТекСтрокаСписок.Размер;
		Движение.График = ТекСтрокаСписок.График;
		Движение.Размер = ТекСтрокаСписок.Размер;
	КонецЦикла;

	// регистр ДополнительныеНачисления
	Движения.ДополнительныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаСписок Из Список Цикл
		Движение = Движения.ДополнительныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаСписок.ВидРасчета;
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.БазовыйПериодНачало = ПериодРегистрации;
		Движение.БазовыйПериодКонец = ПериодРегистрации;
		Движение.Подразделение = ТекСтрокаСписок.Подразделение;
		Движение.Сотрудник = ТекСтрокаСписок.Сотрудник;
		Движение.Результат = ТекСтрокаСписок.Размер;
		Движение.Размер = ТекСтрокаСписок.Размер;
	КонецЦикла;
	
		
	
КонецПроцедуры
